### PANDAS

In [2]:
import numpy as np
import pandas as pd
import matplotlib as plt
import seaborn as sns

### Create Dataframe
Custom data frame is created using dictionaries of python

In [3]:
df = pd.DataFrame({'name': ['Zeeshan', 'Ali', 'Khan', 'Zeeshan'], 'age': [23, 25, 30, 23]})
df

      name  age
0  Zeeshan   23
1      Ali   25
2     Khan   30
3  Zeeshan   23

Loading Data from CSV and from SEABORN in built datasets

In [4]:
# Loading from seaborn inbuilt datasets
ds = sns.load_dataset('titanic')
# Loading Datasets from CSV
csv = pd.read_csv('../Datasets/flights.csv')
ds.head()
# csv.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

## View Info
view info shows details about our dataset number of cols, rows type of columns
##### object
General type â†’ usually means string (text). Example: "Ali", "Hello", "A123" Column usage: Names, Addresses, Codes.
##### category
Special type for fixed categories (saves memory). Example: "Male", "Female" or "Small, Medium, Large" Column usage: Gender, Product Size, Labels.

In [5]:
ds.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

#### Describe
Describe srf numerical values p hota ha uss ka mean std min max values r qurtiles b

In [6]:
ds.describe()

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

##### Viewing Columns

In [7]:
ds.columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone'],
      dtype='object')

#### Creating new columns
df['col_name'] = df['koi_b_name']

In [8]:
ds['check'] = ds['sex'] 
ds.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 16 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
 15  check        891 non-null    object
dtypes: bool(2), category(2), float64(2), int64(4), object(6)
memory usage: 87.6+ KB

#### Renaming Columns

In [9]:
ds.rename(columns={'sex' : 'gender', 'alive' : 'live_status'})
ds.columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone', 'check'],
      dtype='object')

### Counting Unique Values
This shows number or unique values in a specific column

In [10]:
ds['adult_male'].value_counts()

adult_male
True     537
False    354
Name: count, dtype: int64

In [11]:
#Adding Prefix and suffix to column name

# ds = ds['sex'].add_suffix('aa')
add_suffix = pd.read_csv('../Datasets/titanic.csv')
add_suffix['sex'].add_prefix('umr')
add_suffix['sex'].add_suffix('a')
add_suffix.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    object
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    object
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), float64(2), int64(4), object(7)
memory usage: 92.4+ KB

### Exporting Dataset

In [12]:
# Exporting in CSV
df.to_csv('../Datasets/practice/ds.csv')
# Exporting in Excel
df.to_excel('../Datasets/practice/excel_ds.xlsx')

df.to_markdown('../Datasets/practice/ds_md.md')

### Reversing Rows and Cols
we use .loc method to for this loc has many uses we can view any row using this method  
below are few uses

In [13]:
# View any specic row enter row number in loc array
# add_suffix.loc[100]
# If we want to see records upto some specific number than we have to pass the 
# number with colon
# add_suffix.loc[:5]

#Reverse the rows in dataframe
# add_suffix.loc[::-1]

# Resetting the index of dataframe
# add_suffix.loc[::-1].reset_index(drop=True)

# Revrsing columns in dataframe
add_suffix.loc[:, ::-1].head()

,alone,alive,embark_town,deck,adult_male,who,class,embarked,fare,parch,sibsp,age,sex,pclass,survived
0,False,no,Southampton,NaN,True,man,Third,S,7.2500,0,1,22.0,male,3,0
1,False,yes,Cherbourg,C,False,woman,First,C,71.2833,0,1,38.0,female,1,1
2,True,yes,Southampton,NaN,False,woman,Third,S,7.9250,0,0,26.0,female,3,1
3,False,yes,Southampton,C,False,woman,First,S,53.1000,0,1,35.0,female,1,1
4,True,no,Southampton,NaN,True,man,Third,S,8.0500,0,0,35.0,male,3,0

#### Reducing Dataframe Size
<font size=4>Reducing / Creating Chunks of Datafarme</font>

In [ ]:
df = pd.read_csv('../Datasets/diamonds.csv')
# In samples we have to enter the size of rows for our new dataset if we enter
# 1000 it means it will fetch 1000 rows from our original dataset
new_df = df.sample(1000)
new_df.shape
# This will pick random records from our dataset
new_df = df.sample(1000 , random_state=42)
new_df.to_csv('../Datasets/practice/new_df_not_indexed.csv')
# Start from new Index rather than the previous random index
new_df = df.sample(1000 , random_state=42).reset_index()
new_df.to_csv('../Datasets/practice/new_df_indexed.csv')

# We can divide dataset by percentage also 
df_percent = df.sample(frac=0.33).reset_index()
df_percent.to_csv('../Datasets/practice/df_percent.csv')
df_percent.head()

,index,carat,cut,color,clarity,depth,table,price,x,y,z
0,49188,0.70,Fair,F,SI2,65.3,55.0,2075,5.60,5.49,3.62
1,4267,0.80,Ideal,H,VS1,62.2,56.0,3581,5.92,5.95,3.69
2,30801,0.43,Ideal,F,SI2,60.7,57.0,742,4.88,4.91,2.97
3,12749,1.10,Very Good,D,SI2,61.1,58.0,5320,6.61,6.69,4.06
4,29866,0.30,Ideal,D,VS2,61.7,55.0,710,4.33,4.36,2.68

#### Joining Datasets

In [70]:
df_1= pd.DataFrame({'name':['Zeeshan','Ali'], 'age':[25,30]})
df_1.head()
df_2= pd.DataFrame({'Gender':['Male','Female'], 'city':['Lahore','Karachi']})
df_2.head()
df_3 = pd.concat([new_df,df_percent])
df_3.shape

(18800, 11)